In [1]:
!pip install pandas

Requirement already satisfied: pandas in /home/ali/.local/lib/python3.8/site-packages (1.4.1)
Requirement already satisfied: python-dateutil>=2.8.1 in /home/ali/.local/lib/python3.8/site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5; platform_machine != "aarch64" and platform_machine != "arm64" and python_version < "3.10" in /home/ali/.local/lib/python3.8/site-packages (from pandas) (1.22.2)
Requirement already satisfied: pytz>=2020.1 in /home/ali/.local/lib/python3.8/site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in /usr/lib/python3/dist-packages (from python-dateutil>=2.8.1->pandas) (1.14.0)

In [3]:
import pandas as pd

In [4]:
cols= ["ali","reza","ahmad"]

In [5]:
pd.DataFrame(cols)

       0
0    ali
1   reza
2  ahmad

In [10]:
data={"name":cols,"height":[1.75,1.95,1.40],"weight":[80,60,90]}
df=pd.DataFrame(data)

In [14]:
df

    name  height  weight
0    ali    1.75      80
1   reza    1.95      60
2  ahmad    1.40      90

In [18]:
df.iloc[1][['name','height']]

name      reza
height    1.95
Name: 1, dtype: object

In [30]:
bmi=[]
for index,item in df.iterrows():
    bmi.append(item['weight']/item["height"]**2)
bmi

[26.122448979591837, 15.779092702169626, 45.91836734693878]

In [31]:
df

    name  height  weight
0    ali    1.75      80
1   reza    1.95      60
2  ahmad    1.40      90

In [32]:
df['bmi']=bmi

In [33]:
df

    name  height  weight        bmi
0    ali    1.75      80  26.122449
1   reza    1.95      60  15.779093
2  ahmad    1.40      90  45.918367

In [37]:
df.to_csv("person.csv",sep='\t',index=False)

In [38]:
pd.read_csv("person.csv",sep='\t')

    name  height  weight        bmi
0    ali    1.75      80  26.122449
1   reza    1.95      60  15.779093
2  ahmad    1.40      90  45.918367